import { Injectable } from "@angular/core";

@Injectable({
    providedIn: 'root'
  })
export class Van {
    
    van_time = ["5:00", "5:30", "6:00", "6:30", "7:00", "7:30", "8:00", "8:30", "9:00", "9:30", "10:00", "10:30", "11:00", "11:30", 
    "12:00", "12:30", "13:00", "13:30", "14:00", "14:30", "15:00", "15:30", "16:00", "16:30", "17:00", "17:30", "18:00", "18:30", "19:00",
    "19:30", "20:00", "20:30", "21:00", "21:30", "22:00", "22:30", "23:00", "23:30", "00:00"];

    vanline_list = ["พฤกษา 3 - เดอะมอลล์งามวงศ์วาน", "พฤกษา 3 - พาต้า"];

    van_pickup1 = ["หมู่บ้านพฤกษา 3", "เดอะมอลล์งามวงศ์วาน"];
    van_dest1_1 = [
        "บ้านกล้วย", "หมู่บ้านบัวทอง", "หมู่บ้านรัตนาธิเบศร์", "เซ็นทรัลเวสต์เกส", "วัดมะเดื่อ",
        "วัดไผ่เหลือง", "แยกบางพลู", "ปากซอยท่าอิฐ", "หมู่บ้านซื่อตรง", "เซ็นทรัลรัตนาธิเบศร์", "บิ๊กซีรัตนาธิเบศร์", "ศาลากลางจังหวัดนนทบุรี",
        "เอสพลานาด งามวงศ์วาน-แคราย", "พันธุ์ทิพย์งามวงศ์วาน", "เดอะมอลล์งามวงศ์วาน"];
    van_dest1_2 = [
        "พันธุ์ทิพย์งามวงศ์วาน", "เอสพลานาด งามวงศ์วาน-แคราย", "ศาลากลางจังหวัดนนทบุรี", "บิ๊กซีรัตนาธิเบศร์", "เซ็นทรัลรัตนาธิเบศร์",
        "หมู่บ้านซื่อตรง", "ปากซอยท่าอิฐ", "แยกบางพลู", "วัดไผ่เหลือง", "วัดมะเดื่อ", "เซ็นทรัลเวสต์เกส", "หมู่บ้านรัตนาธิเบศร์",
        "หมู่บ้านบัวทอง", "บ้านกล้วย", "หมู่บ้านพฤกษา 3"];

    van_pickup2 = ["หมู่บ้านพฤกษา 3", "พาต้าปิ่นเกล้า"];
    van_dest2_1 = [
        "บ้านกล้วย", "หมู่บ้านบัวทอง", "หมู่บ้านรัตนาธิเบศร์", "เซ็นทรัลเวสต์เกส", "บุญยง ตลาดต้นไม้",
        "วัดคงคา", "โลตัสบางใหญ่", "โรงเรียนเทพศิรินทร์นนทบุรี", "ซอยศรีประวัติ", "สถานีขนส่งสายใต้ใหม่(ตลิ่งชัน)", "วัดมะกอก", "ไปรษณีย์ ตลิ่งชัน",
        "กระทรวงวัฒนธรรมลุมพินีพาร์คปิ่นเกล้า", "เมเจอร์ปิ่นเกล้า", "โลตัสปิ่นเกล้า", "พาต้าปิ่นเกล้า"];
    van_dest2_2 = [
        "โลตัสปิ่นเกล้า", "เมเจอร์ปิ่นเกล้า", "กระทรวงวัฒนธรรมลุมพินีพาร์คปิ่นเกล้า", "ไปรษณีย์ ตลิ่งชัน", "วัดมะกอก",
        "สถานีขนส่งสายใต้ใหม่(ตลิ่งชัน)", "ซอยศรีประวัติ", "โรงเรียนเทพศิรินทร์นนทบุรี", "โลตัสบางใหญ่", "วัดคงคา", "บุญยง ตลาดต้นไม้", "เซ็นทรัลเวสต์เกส",
        "หมู่บ้านรัตนาธิเบศร์", "หมู่บ้านบัวทอง", "บ้านกล้วย", "หมู่บ้านพฤกษา 3"];

}